In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%cd '/content/drive/My Drive/Kaggle'

/content/drive/My Drive/Kaggle

In [17]:
import pandas as pd

df = pd.read_csv('titanic_train.csv')
summer = pd.read_csv('summer.csv')
df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [6]:
summer.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

# To do List

* Identify different data types in column
* How to work with numeric values
* Set New Index
* Drop Specifc column
* Smallest Values
* Data Types
* Concat
* Merge
* Split data

In [7]:
summer.head()

   Year    City     Sport  ... Gender                       Event   Medal
0  1896  Athens  Aquatics  ...    Men              100M Freestyle    Gold
1  1896  Athens  Aquatics  ...    Men              100M Freestyle  Silver
2  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4  1896  Athens  Aquatics  ...    Men  100M Freestyle For Sailors  Silver

[5 rows x 9 columns]

In [8]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [9]:
summer.Year.dtypes

dtype('int64')

In [10]:
summer.dtypes

Year           int64
City          object
Sport         object
Discipline    object
Athlete       object
Country       object
Gender        object
Event         object
Medal         object
dtype: object

In [11]:
summer.Year = summer.Year.astype('object')
summer.dtypes

Year          object
City          object
Sport         object
Discipline    object
Athlete       object
Country       object
Gender        object
Event         object
Medal         object
dtype: object

In [12]:
summer.Year = summer.Year.astype('int64')
summer.dtypes

Year           int64
City          object
Sport         object
Discipline    object
Athlete       object
Country       object
Gender        object
Event         object
Medal         object
dtype: object

In [14]:
todo = ['Identify different data types in column' 
,'How to work with numeric values'
,'Set New Index'
,'Drop Specifc column'
,'Smallest Values'
,'Data Types'
,'Concat'
,'Merge'
,'Split data']

In [15]:
todo

['Identify different data types in column',
 'How to work with numeric values',
 'Set New Index',
 'Drop Specifc column',
 'Smallest Values',
 'Data Types',
 'Concat',
 'Merge',
 'Split data']

In [18]:
summer.Year.apply(lambda x: type(x)).value_counts()

<class 'int'>    31165
Name: Year, dtype: int64

In [20]:
summer.Medal.apply(lambda x: type(x)).value_counts()

<class 'str'>    31165
Name: Medal, dtype: int64

In [21]:
summer.isna().sum()

Year          0
City          0
Sport         0
Discipline    0
Athlete       0
Country       4
Gender        0
Event         0
Medal         0
dtype: int64

In [22]:
missing = summer[summer.isna().any(axis=1)]
missing

       Year    City          Sport  ... Gender     Event   Medal
29603  2012  London      Athletics  ...  Women     1500M    Gold
31072  2012  London  Weightlifting  ...  Women      63KG    Gold
31091  2012  London  Weightlifting  ...    Men      94KG  Silver
31110  2012  London      Wrestling  ...    Men  Wf 60 KG  Silver

[4 rows x 9 columns]

In [24]:
summer.dropna(axis=0, inplace=True)

In [25]:
summer.isna().sum()

Year          0
City          0
Sport         0
Discipline    0
Athlete       0
Country       0
Gender        0
Event         0
Medal         0
dtype: int64

In [26]:
len(summer)

31161

In [27]:
df.dtypes

passenger_id      int64
pclass            int64
name             object
sex              object
age             float64
sibsp             int64
parch             int64
ticket           object
fare            float64
cabin            object
embarked         object
boat             object
body            float64
home.dest        object
survived          int64
dtype: object

In [28]:
df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [29]:
df.dropna(inplace=True)

In [30]:
df.isna().sum()

passenger_id    0
pclass          0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin           0
embarked        0
boat            0
body            0
home.dest       0
survived        0
dtype: int64

In [31]:
df.groupby(by='sex')

In [32]:
# SELECT SUM(AGE), SEX FROM DF GROUP BY SEX
df.groupby(by='sex').sum()

Empty DataFrame
Columns: [passenger_id, pclass, age, sibsp, parch, fare, body, survived]
Index: []

In [33]:
df.head()

Empty DataFrame
Columns: [passenger_id, pclass, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest, survived]
Index: []

In [34]:
len(df)

0

In [36]:
df = pd.read_csv('titanic_train.csv')
df2 = pd.read_csv('titanic_train.csv')
len(df)

850

In [37]:
df.isna().sum()

passenger_id      0
pclass            0
name              0
sex               0
age             174
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64

In [42]:
df2.rename(columns={'age':'age_summed'}, inplace=True)
df2.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [43]:
right_join_df = df2.groupby('sex').sum()
right_join_df

        passenger_id  pclass  sibsp  parch        fare     body  survived
sex
female        176203     642    212    175  14155.4881    921.0       210
male          387191    1330    232    150  14721.2950  11184.0       103

In [44]:
df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [45]:
df.sex.isna().sum()

0

In [47]:
right_join_df.columns

Index(['passenger_id', 'pclass', 'sibsp', 'parch', 'fare', 'body', 'survived'], dtype='object')

In [49]:
right_join_df.head()

        passenger_id  pclass  sibsp  parch        fare     body  survived
sex
female        176203     642    212    175  14155.4881    921.0       210
male          387191    1330    232    150  14721.2950  11184.0       103

In [50]:
right_join_df.drop(['passenger_id','pclass','sibsp','parch','fare','body','survived'], axis=1)

Empty DataFrame
Columns: []
Index: [female, male]

In [51]:
df.join(right_join_df, on='sex', how='left',)
df.head()

ValueError: ignored

In [52]:
df2

     passenger_id  pclass  ...                 home.dest survived
0            1216       3  ...                       NaN        1
1             699       3  ...                   Croatia        0
2            1267       3  ...                       NaN        0
3             449       2  ...      Cornwall / Akron, OH        1
4             576       2  ...  Barre, Co Washington, VT        0
..            ...     ...  ...                       ...      ...
845           158       1  ...       London / Birmingham        0
846           174       1  ...               Buffalo, NY        0
847           467       2  ...        Moscow / Bronx, NY        1
848          1112       3  ...                       NaN        0
849           425       2  ...                 Bronx, NY        0

[850 rows x 15 columns]

In [53]:
df

     passenger_id  pclass  ...                 home.dest survived
0            1216       3  ...                       NaN        1
1             699       3  ...                   Croatia        0
2            1267       3  ...                       NaN        0
3             449       2  ...      Cornwall / Akron, OH        1
4             576       2  ...  Barre, Co Washington, VT        0
..            ...     ...  ...                       ...      ...
845           158       1  ...       London / Birmingham        0
846           174       1  ...               Buffalo, NY        0
847           467       2  ...        Moscow / Bronx, NY        1
848          1112       3  ...                       NaN        0
849           425       2  ...                 Bronx, NY        0

[850 rows x 15 columns]

In [55]:
df2.drop(['passenger_id','pclass','sibsp','parch','fare','body','survived'], axis=1)

                                                  name  ...                 home.dest
0                                   Smyth, Miss. Julia  ...                       NaN
1                                      Cacic, Mr. Luka  ...                   Croatia
2    Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...  ...                       NaN
3                Hocking, Mrs. Elizabeth (Eliza Needs)  ...      Cornwall / Akron, OH
4                                      Veal, Mr. James  ...  Barre, Co Washington, VT
..                                                 ...  ...                       ...
845                        Hipkins, Mr. William Edward  ...       London / Birmingham
846                            Kent, Mr. Edward Austin  ...               Buffalo, NY
847                Kantor, Mrs. Sinai (Miriam Sternin)  ...        Moscow / Bronx, NY
848                          Peacock, Miss. Treasteall  ...                       NaN
849                              Greenberg, Mr. Samuel  ...                 Bronx, NY

[850 rows x 8 columns]

In [54]:
df.join(df2)

ValueError: ignored

In [57]:
df_3 = df.groupby('pclass')[['survived','fare']].sum()
df_3

        survived        fare
pclass
1            125  18776.9960
2             76   3529.1458
3            112   6570.6413

In [60]:
pd.merge(df, df_3, how='left', left_index=False, right_index=True, left_on='pclass')

     passenger_id  pclass  ... survived_y      fare_y
0            1216       3  ...        112   6570.6413
1             699       3  ...        112   6570.6413
2            1267       3  ...        112   6570.6413
3             449       2  ...         76   3529.1458
4             576       2  ...         76   3529.1458
..            ...     ...  ...        ...         ...
845           158       1  ...        125  18776.9960
846           174       1  ...        125  18776.9960
847           467       2  ...         76   3529.1458
848          1112       3  ...        112   6570.6413
849           425       2  ...         76   3529.1458

[850 rows x 17 columns]

In [61]:
df.columns

Index(['passenger_id', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest',
       'survived'],
      dtype='object')

```
SELECT t1.`pclass`, `age`,`name`, `total_survived`
FROM df t1 
LEFT JOIN
        (SELECT `pclass`
        , SUM(`survived`) as 'total_survived'
        FROM df
        GROUP BY `pclass`) t2
  ON t1.pclass = t2.pclass
```

In [66]:
 df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [67]:
df_3 = df.groupby('pclass')['survived'].sum()

In [64]:
df_3

pclass
1    125
2     76
3    112
Name: survived, dtype: int64

In [65]:
df.join(df_3, lsuffix='pclass', rsuffix='index')

     passenger_id  pclass  ... survivedpclass survivedindex
0            1216       3  ...              1           NaN
1             699       3  ...              0         125.0
2            1267       3  ...              0          76.0
3             449       2  ...              1         112.0
4             576       2  ...              0           NaN
..            ...     ...  ...            ...           ...
845           158       1  ...              0           NaN
846           174       1  ...              0           NaN
847           467       2  ...              1           NaN
848          1112       3  ...              0           NaN
849           425       2  ...              0           NaN

[850 rows x 16 columns]